{
  "git": {
    "commit": "Walks you through creating a commit with staged files, allows you to select a JIRA or bug that is assigned to you, set reviewers etc.",
    "commitAll": "Walks you through creating a commit with all edited files, allows you to select a JIRA or bug that is assigned to you, set reviewers etc.",
    "amendCommit": "Adds staged file changes to existing commit",
    "amendCommitAll": "Adds all edited files to existing commit",
    "sandbox": "Starts a sandbox build",
    "review": "Posts a review based on the information in the commit, sets bug number, reviewers on review",
    "pushable": "Checks if review has ship its, checks for checkstyle errors, checks status of buildweb and jenkins builds in testing done section",
    "push": "Performs a git push, closes any associated review",
    "createMergeRequest": "Creates merge request and topic branch only if more granular control is desired",
    "merge": "Creates the merge request, topic branch, approves request and assigns request to the merge bot. Closes any associated review"
  },
  "perforce": {
    "moveOpenFilesToPendingChangelist": "Moves all open files to the specified pending perforce changelist",
    "sandbox": "Starts a sandbox build",
    "review": "Posts a review based on the information in the commit, sets bug number, reviewers on review",
    "pushable": "Checks if review has ship its, checks for checkstyle errors, checks status of buildweb and jenkins builds in testing done section",
    "submit": "Peforms a perforce submit. Changelist is submitted to depot. Closes any associated review"
  },
  "vApp": {
    "deleteVapp": "Delete selected vApp, uses force flag so can delete powered on vApps",
    "deleteVm": "Delete selected VM, uses force flag so can delete powered on VM",
    "openVappProvider": "Opens the provider UI for the Vcd cell in the Vapp",
    "renameVapp": "Allows for renaming a vapp",
    "updateVappLease": "Allows for updating the vapp lease",
    "tailVappLogFile": "Tails the output from a specified vapp log file",
    "displayVappJson": "Displays the testbed template json for the specified vapp"
  },
  "batch": {
    "closeOldReviews": "Closes old reviewboard reviews",
    "createTrelloBoardFromLabel": "Creates a Trello board from a Jira label",
    "createTrelloBoardFromFixVersion": "Creates a Trello boad from a Jira fix version",
    "setStoryPointsForBoard": "Sets story points for Jira issues from Trello board"
  }
}